-- phpMyAdmin SQL Dump
-- version 4.5.4.1deb2ubuntu2
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2018 年 4 月 17 日 03:41
-- サーバのバージョン： 5.7.21-0ubuntu0.16.04.1
-- PHP Version: 7.0.22-0ubuntu0.16.04.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `ghexample`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `jusho`
--

DROP TABLE IF EXISTS `jusho`;
CREATE TABLE `jusho` (
  `idju` int(11) NOT NULL,
  `company` varchar(50) NOT NULL,
  `state` varchar(10) NOT NULL,
  `address` varchar(200) NOT NULL,
  `zip` varchar(8) NOT NULL,
  `tel` varchar(15) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `jusho`
--

INSERT INTO `jusho` (`idju`, `company`, `state`, `address`, `zip`, `tel`) VALUES
(1101, 'シリウス社', '東京都', '世田谷区赤堤', '156-0044', '03-1234-5678'),
(1102, 'ベガ社', '東京都', '世田谷区桜丘', '156-0054', '03-1234-5679'),
(1103, 'カペラ社', '東京都', '世田谷区祖師谷', '157-0072', '03-1234-5680'),
(1104, 'リゲル社', '東京都', '大田区鵜の木', '146-0091', '03-1234-5681'),
(1105, 'ベテルギウス社', '東京都', '目黒区大岡山', '152-0033', '03-1234-5682'),
(1106, 'アルタイル社', '東京都', '目黒区大岡山', '152-0033', '03-1234-5683'),
(1107, 'ボルックス社', '東京都', '品川区戸越', '142-0041', '03-1234-5684'),
(1108, 'デネブ社', '東京都', '品川区二葉', '142-0043', '03-1234-5685'),
(1109, 'アルデバラン社', '大阪府', '泉大津市我孫子', '595-0031', '0725-23-8899'),
(1110, 'ピーコック社', '大阪府', '泉大津市我孫子', '595-0031', '0725-23-8900'),
(1111, 'メンカリナン社', '大阪府', '泉大津市我孫子', '595-0031', '0725-23-8901'),
(1112, 'プロキオン社', '大阪府', '泉大津市豊中町', '595-0023', '0725-23-8902'),
(1113, 'カノープス社', '大阪府', '大阪市北区梅田', '530-0001', '06-2223-8903'),
(1114, 'アークツルス社', '大阪府', '大阪市北区堂島浜', '530-0004', '06-2223-8904'),
(1115, 'サルガス社', '愛知県', '岡崎市上和田町', '444-0201', '0564-12-3456'),
(1116, 'ベネトナシュ社', '愛知県', '名古屋市中村区名駅南', '450-0003', '052-123-5678'),
(1117, 'ドゥーベ社', '愛知県', '名古屋市中村区名駅南', '450-0003', '052-123-5679'),
(1118, 'ベラトリックス社', '愛知県', '名古屋市中村区名駅南', '450-0003', '052-123-5680'),
(1119, 'ウェズン社', '愛知県', '名古屋市中村区松重町', '450-0004', '052-123-5681'),
(1120, 'ミルファク社', '愛知県', '名古屋市熱田区金山町', '456-0002', '052-123-5682'),
(1121, 'アルナイル社', '広島県', '広島県尾道市古浜町', '722-0002', '0848-66-7777'),
(1122, 'シャウラ社', '広島県', '広島県尾道市古浜町', '722-0002', '0848-66-7778'),
(1123, 'エルナト社', '広島県', '広島県尾道市正徳町', '722-0004', '0848-66-7779'),
(1124, 'アルニラム社', '北海道', '北海道網走市浦士別', '099-3502', '0152-33-6969'),
(1125, 'カストル社', '北海道', '北海道網走市清浦', '099-3504', '0152-33-6970'),
(1126, 'ガクルックス社', '北海道', '北海道網走市清浦', '099-3504', '0152-33-6971'),
(1127, 'レグルス社', '北海道', '北海道網走市清浦', '099-3504', '0152-33-6972');

-- --------------------------------------------------------

--
-- テーブルの構造 `shohin`
--

DROP TABLE IF EXISTS `shohin`;
CREATE TABLE `shohin` (
  `idsh` varchar(20) NOT NULL,
  `product` varchar(50) NOT NULL,
  `price` decimal(10,0) NOT NULL,
  `category` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `shohin`
--

INSERT INTO `shohin` (`idsh`, `product`, `price`, `category`) VALUES
('j221001', 'ボールペン黒1ダース', '1440', '事務用品'),
('j221002', 'ボールペン赤1ダース', '1440', '事務用品'),
('j224001', '消しゴム1ダース', '1200', '事務用品'),
('m132001', '万年筆A', '3700', '万年筆'),
('m132002', '万年筆B', '3700', '万年筆'),
('m132003', '万年筆C', '3700', '万年筆'),
('p102001', 'ペンケース赤', '2500', 'ペンケース'),
('p102002', 'ペンケース青', '2500', 'ペンケース'),
('p102003', 'ペンケース黄', '2500', 'ペンケース');

-- --------------------------------------------------------

--
-- テーブルの構造 `uriage`
--

DROP TABLE IF EXISTS `uriage`;
CREATE TABLE `uriage` (
  `idur` int(11) NOT NULL,
  `company` varchar(50) NOT NULL,
  `charge` decimal(10,0) NOT NULL,
  `salesdate` datetime DEFAULT NULL,
  `state` varchar(10) NOT NULL,
  `area` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `uriage`
--

INSERT INTO `uriage` (`idur`, `company`, `charge`, `salesdate`, `state`, `area`) VALUES
(2017090001, 'シリウス社', '20000', '2017-09-04 00:00:00', '東京都', '世田谷区'),
(2017090002, 'ベガ社', '194400', '2017-09-04 00:00:00', '東京都', '世田谷区'),
(2017090003, 'カノープス社', '118800', '2017-09-04 00:00:00', '大阪府', '大阪市'),
(2017090004, 'リゲル社', '24840', '2017-09-04 00:00:00', '東京都', '大田区'),
(2017090005, 'ベテルギウス社', '105840', '2017-09-07 00:00:00', '東京都', '大田区'),
(2017090006, 'シリウス社', '302400', '2017-09-08 00:00:00', '東京都', '世田谷区'),
(2017090007, 'ベガ社', '205200', '2017-09-08 00:00:00', '東京都', '世田谷区'),
(2017090008, 'カペラ社', '103680', '2017-09-09 00:00:00', '東京都', '世田谷区'),
(2017090009, 'シリウス社', '270000', '2017-09-11 00:00:00', '東京都', '世田谷区'),
(2017090010, 'ベガ社', '162000', '2017-09-11 00:00:00', '東京都', '世田谷区'),
(2017090011, 'カノープス社', '162000', '2017-09-11 00:00:00', '大阪府', '大阪市'),
(2017090012, 'シリウス社', '248400', '2017-09-13 00:00:00', '東京都', '世田谷区'),
(2017090013, 'ベガ社', '129600', '2017-09-14 00:00:00', '東京都', '世田谷区'),
(2017090014, 'カペラ社', '88560', '2017-09-15 00:00:00', '東京都', '世田谷区'),
(2017090015, 'リゲル社', '49680', '2017-09-15 00:00:00', '東京都', '大田区'),
(2017090016, 'ミルファク社', '73440', '2017-09-15 00:00:00', '愛知県', '名古屋市'),
(2017090017, 'シリウス社', '226800', '2017-09-19 00:00:00', '東京都', '世田谷区'),
(2017090018, 'カノープス社', '140400', '2017-09-19 00:00:00', '大阪府', '大阪市'),
(2017090019, 'カペラ社', '101520', '2017-09-19 00:00:00', '東京都', '世田谷区'),
(2017090020, 'リゲル社', '70200', '2017-09-19 00:00:00', '東京都', '大田区'),
(2017090021, 'カストル社', '48600', '2017-09-20 00:00:00', '北海道', '網走市'),
(2017090022, 'ガクルックス社', '34560', '2017-09-21 00:00:00', '北海道', '網走市'),
(2017090023, 'ミルファク社', '81000', '2017-09-22 00:00:00', '愛知県', '名古屋市'),
(2017090024, 'ガクルックス社', '34560', '2017-09-22 00:00:00', '北海道', '網走市'),
(2017090025, 'シリウス社', '216000', '2017-09-25 00:00:00', '東京都', '世田谷区'),
(2017090026, 'ベガ社', '194400', '2017-09-25 00:00:00', '東京都', '世田谷区');

-- --------------------------------------------------------

--
-- テーブルの構造 `zaseki`
--

DROP TABLE IF EXISTS `zaseki`;
CREATE TABLE `zaseki` (
  `idza` varchar(5) NOT NULL,
  `shimei` varchar(50) DEFAULT NULL,
  `yoyakubi` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `zaseki`
--

INSERT INTO `zaseki` (`idza`, `shimei`, `yoyakubi`) VALUES
('c26', '斧定九郎', '2018-01-18 12:30:21'),
('c27', NULL, NULL),
('c28', '桜井若狭之助', '2018-01-04 10:20:11');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `jusho`
--
ALTER TABLE `jusho`
  ADD PRIMARY KEY (`idju`);

--
-- Indexes for table `shohin`
--
ALTER TABLE `shohin`
  ADD PRIMARY KEY (`idsh`);

--
-- Indexes for table `uriage`
--
ALTER TABLE `uriage`
  ADD PRIMARY KEY (`idur`);

--
-- Indexes for table `zaseki`
--
ALTER TABLE `zaseki`
  ADD PRIMARY KEY (`idza`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
